In [3]:
import pandas as pd
from datetime import datetime

In [33]:
df = pd.read_csv('/home/jupyter-d.bezhenar-15/shared/hall_of_fame/lesson_2_data.csv', encoding = 'windows-1251', sep = ';')

In [53]:
df1 = df['Title'].drop_dublicates()
df1

AttributeError: 'Series' object has no attribute 'drop_dublicates'

In [37]:
df1.drop(columns=['Title'])

,Номер,Дата создания,Дата оплаты,Статус,Заработано,Город,Платежная система
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Завершен,29597.5,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Завершен,17450.3,Краснодар,Яндекс.Касса

In [29]:
df.money = df.money.astype('int')

In [6]:
df.isna().sum()

Номер                  0
Дата создания          0
Дата оплаты          112
Title                  0
Статус                 0
Заработано             0
Город                 13
Платежная система    110
dtype: int64

In [28]:
df.dtypes

number              int64
create_date        object
payment_date       object
tittle             object
status             object
money             float64
city               object
payment_system     object
dtype: object

In [10]:
 df = df.rename(columns={'Номер': 'number', 
                   'Дата создания': 'create_date', 
                   'Дата оплаты': 'payment_date', 
                   'Title': 'tittle', 
                   'Статус': 'status',
                   'Заработано': 'money', 
                   'Город': 'city', 
                   'Платежная система': 'payment_system'})

In [49]:
df

,Номер,Дата создания,Дата оплаты,Title,Статус,Заработано,Город,Платежная система
0,1062823,01.12.2019 10:50,01.12.2019 10:52,Курс обучения «Эксперт»,Завершен,29597.50,Чита,Сбербанк эквайринг
1,1062855,01.12.2019 20:53,01.12.2019 21:27,Курс обучения «Эксперт»,Завершен,17450.30,Краснодар,Яндекс.Касса
2,1062856,01.12.2019 21:43,NaN,Курс обучения «Специалист»,Отменен,0.00,NaN,NaN
3,1062880,03.12.2019 0:18,NaN,Курс обучения «Консультант»,Отменен,0.00,г.Москва и Московская область,NaN
4,1062899,03.12.2019 21:43,NaN,Курс обучения «Эксперт»,Отменен,0.00,г.Москва и Московская область,NaN
...,...,...,...,...,...,...,...,...
287,1064720,30.12.2019 9:42,30.12.2019 12:49,Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...,Завершен,2935.44,Самарская область,Яндекс.Касса
288,1064724,30.12.2019 11:32,NaN,Курс обучения «Консультант»,Отменен,0.00,NaN,NaN
289,1064775,31.12.2019 2:17,31.12.2019 2:22,Курс обучения «Консультант»,Завершен,7423.92,NaN,"Сбербанк эквайринг,Бонусный счет"
290,1064793,31.12.2019 16:40,01.01.2020 14:29,Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...,Завершен,2935.44,Республика Карелия,Яндекс.Касса
291,1064796,31.12.2019 17:29,31.12.2019 17:32,Курс от Школы Диетологов. Повышение квалификац...,Завершен,9898.56,Уфа,"Сбербанк эквайринг,Бонусный счет"

In [ ]:
xxx = ['Завершен', 'Отменен']

In [11]:
  money_title = df \
        .query("status in ['Завершен', 'Отменен']") \
        .groupby(['tittle'], as_index=False) \
        .aggregate({'money': 'sum', 'number': 'count'}) \
        .sort_values('money', ascending=False) \
        .rename(columns={'number': 'success_orders'})

In [8]:
money_title

,tittle,money,success_orders
5,Подписка «ОНЛАЙН ДИЕТОЛОГ» с ежемесячным автос...,366947.20,125
0,Курс обучения «Консультант»,208163.49,31
1,Курс обучения «Специалист»,160862.64,7
2,Курс обучения «Эксперт»,148992.80,5
4,Курс от Школы Диетологов. Повышение квалификац...,88384.92,9
3,Курс от Школы Диетологов. Бизнес,18752.54,3

In [7]:
int(df.money.sum())

992103

In [8]:
int(money_title.money.sum())

992103

In [9]:
today_day = datetime.now().strftime('%Y-%m-%d')
file_name = f'money_title_{today_day}.csv'
file_name

'money_title_2021-08-24.csv'

In [10]:
if int(money_title.money.sum()) == int(df.money.sum()):
    print(f'OK! file {file_name} saved')
    money_title.to_csv(file_name, index=False)
else:
    print('error')

OK! file money_title_2021-08-24.csv saved

In [55]:
asd = pd.DataFrame({'Col1': [0.5,6,-9],
      'Col2': [0.5,0.5,0.6],
      'Col3': [0.5,4,3]})
asd

   Col1  Col2  Col3
0   0.5   0.5   0.5
1   6.0   0.5   4.0
2  -9.0   0.6   3.0

In [48]:
new_fr = new_fr[['Col1', 'Col2']]
new_fr

   Col1  Col2
0   0.5   0.5
1   6.0   0.5
2  -9.0   0.5

In [41]:
qq = new_fr.drop_duplicates()

In [42]:
qq

   Col1  Col2  Col3
0   0.5   0.5   0.5
1   6.0   0.5   4.0
2  -9.0   0.5   3.0

In [43]:
qq.loc[qq.duplicated()]

Empty DataFrame
Columns: [Col1, Col2, Col3]
Index: []

In [45]:
qq.reset_index().drop_duplicates(subset=['Col1', 'Col2', 'Col2'])

   index  Col1  Col2  Col3
0      0   0.5   0.5   0.5
1      1   6.0   0.5   4.0
2      2  -9.0   0.5   3.0

In [56]:
asd

   Col1  Col2  Col3
0   0.5   0.5   0.5
1   6.0   0.5   4.0
2  -9.0   0.6   3.0

In [60]:
asd.drop_duplicates(subset=['Col2'])

   Col1  Col2  Col3
0   0.5   0.5   0.5
2  -9.0   0.6   3.0

In [61]:
numbers = [1, -2, 3, 0, -3, 2]

In [62]:
positive_numbers = []
for i in numbers:
    if i > 0:
        positive_numbers.append(i)
    elif i == 0:
        break

In [63]:
positive_numbers

[1, 3]